TerryFogg/nf-Community-Targets/ThreadX/ST/STM32H7/Common/DeviceIO.cpp
#pragma region GPIO
bool GpioIO::Initialize()
{
    // Track the Pin usage as only 1 interrupt per PIN number 0..16
    memset(ActiveInterruptPin, PinNameValue::NONE, sizeof(PinNameValue::NONE));
    return true;
}
bool GpioIO::InitializePin(PinNameValue pinNameValue)
{
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    if (!LL_AHB4_GRP1_IsEnabledClock(GpioPortClockEnable[GPIOPortByNumber]))
    {
        LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
    }
    return true;
}
bool GpioIO::Dispose(PinNameValue pinNameValue)
{
    GpioIO::InterruptRemove(pinNameValue);
    GpioIO::SetLowPower(pinNameValue);
    return true;
}
bool GpioIO::Read(PinNameValue pinNameValue)
{
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);
    return (bool)LL_GPIO_IsInputPinSet(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
}
bool GpioIO::Write(PinNameValue pinNameValue, bool pinState)
{
    // true == 1
    // false == 0
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);

    if (pinState == GpioPinValue_Low)
    {
        LL_GPIO_ResetOutputPin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    }
    else if (GpioPinValue_High)
    {
        LL_GPIO_SetOutputPin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    }
    return true;
}
bool GpioIO::Toggle(PinNameValue pinNameValue)
{
    bool status = false;
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);
    LL_GPIO_TogglePin(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    status = true;
    return status;
}
bool GpioIO::SetFunction(Device::DevicePin devicePin)
{
    int pinNumber = devicePin.pinNameValue;
    int GPIOPortByNumber = PORT_INDEX(pinNumber);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNumber);

    bool status = false;
    switch (devicePin.CurrentFunction)
    {
        case Device::DevicePinFunction::NONE:
            status = true;
            break;
        case Device::DevicePinFunction::ADC:
            LL_GPIO_InitTypeDef GPIO_InitStruct;
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_MODE_ANALOG);
            break;
        case Device::DevicePinFunction::CAN:
            // Not supported on this MCU
            status = false;
            break;
        case Device::DevicePinFunction::DAC:
            status = false;
            break;
        case Device::DevicePinFunction::GPIO:
            status = true;
            break;
        case Device::DevicePinFunction::SPI:
            status = true;
            break;
        case Device::DevicePinFunction::COUNTER:
            status = true;
            break;
        case Device::DevicePinFunction::PWM:
            status = true;
            break;
        case Device::DevicePinFunction::SD:
            status = true;
            break;
        case Device::DevicePinFunction::TIMER:
            status = true;
            break;
        case Device::DevicePinFunction::I2C:
        {
            LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_MODE_ALTERNATE);
            if (gpioPortPinNumber <= 7)
            {
                LL_GPIO_SetAFPin_8_15(Port[GPIOPortByNumber], gpioPortPinNumber, alternateFunctionNumber);
            }
            if (gpioPortPinNumber >= 8)
            {
                LL_GPIO_SetAFPin_8_15(Port[GPIOPortByNumber], gpioPortPinNumber, alternateFunctionNumber);
            }
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_SPEED_FREQ_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], gpioPortPinNumber, LL_GPIO_OUTPUT_OPENDRAIN);
        }
            status = true;
            break;
        case Device::DevicePinFunction::I2S:
            status = true;
            break;
        case Device::DevicePinFunction::USART:
            LL_AHB4_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
            GPIO_InitStruct.Alternate = alternateFunctionNumber;
            GPIO_InitStruct.Pin = gpioPortPinNumber;
            GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
            GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
            GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
            GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
            LL_GPIO_Init(Port[GPIOPortByNumber], &GPIO_InitStruct);
            status = true;
            break;
        case Device::DevicePinFunction::WAKEUP:
            status = true;
            break;
        default:
            status = false;
            break;
    }
    return status;
}
bool GpioIO::SetLowPower(PinNameValue pinNameValue)
{
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    int gpioPortPinNumber = PIN_INDEX(pinNameValue);

    // Set the unused pins as input(floating) to minimize current consumption.
    LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
    LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_NO);

    return true;
}
bool GpioIO::SetMode(PinNameValue pinNameValue, PinMode pinMode)
{
    // For GPIO details of the STM32, see section 4.3 of
    // https://www.st.com/resource/en/application_note/dm00315319-stm32-gpio-configuration-for-hardware-settings-and-lowpower-consumption-stmicroelectronics.pdf
    //

    bool status = false;
    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);

    switch (pinMode)
    {
        // Configures the GPIO pin in floating mode, with high impedance.
        case PinMode_Input:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_NO);
            status = true;
            break;

        // Configures the GPIO pin as high impedance with a pull-down resistor to ground.
        case PinMode_InputPullDown:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_DOWN);
            status = true;
            break;

        // Configures the GPIO pin as high impedance with a pull-up resistor to the voltage charge connection (VCC).
        case PinMode_InputPullUp:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_INPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_UP);
            status = true;
            break;

        // Configures the GPIO pin in strong drive mode, with low impedance.
        case PinMode_Output:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_OUTPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            status = true;
            break;

