TerryFogg/nf-Community-Targets/ThreadX/ST/STM32H7/Common/DeviceIO.cpp
            // Configures the GPIO in open drain mode
        case PinMode_OutputOpenDrain:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_OUTPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            status = true;
            break;

        // Configures the GPIO pin in open drain mode with resistive pull-up mode.
        case PinMode_OutputOpenDrainPullUp:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_OUTPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_OPENDRAIN);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_UP);
            status = true;
            break;

        // FROM C# description : Configures the GPIO pin in open collector mode.
        // NOTE: "open collector" is functionally the same as an "open drain"
        // Re-use the OutputOpenSource for Push Pull
        case PinMode_OutputOpenSource:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_OUTPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_PUSHPULL);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_NO);
            status = true;
            break;

        // FROM C# description : Configures the GPIO pin in open collector mode.
        // NOTE: "open collector" is functionally the same as an "open drain"
        // Re-use the OutputOpenSource for Push Pull
        case PinMode_OutputOpenSourcePullDown:
            LL_GPIO_SetPinMode(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_MODE_OUTPUT);
            LL_GPIO_SetPinSpeed(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_SPEED_FREQ_VERY_HIGH);
            LL_GPIO_SetPinOutputType(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_OUTPUT_PUSHPULL);
            LL_GPIO_SetPinPull(Port[GPIOPortByNumber], PinMask[gpioPortPinNumber], LL_GPIO_PULL_DOWN);
            status = true;
            break;

        default:
            status = false;
            break;
    }
    return status;
}
bool GpioIO::InterruptEnable(PinNameValue pinNumber, GPIO_INT_EDGE events, void *interruptRoutine)
{
    // NOTE: There is a limitation of 16 external interrupts on the GPIO lines with one 1 interrupt per line number.
    //      One interrupt on (PA0 or PB0 or PC0 or PD0...) and one interrupt on (PA1, or PB1 or PC1 ...) etc.
    bool result = false;


    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);


    int GPIOPortByNumber = PORT_INDEX(pinNameValue);
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);
    uint32_t priority = 0;
    LL_SYSCFG_SetEXTISource(SyscfgPorts[GPIOPortByNumber], PinMask[gpioPortPinNumber]);
    switch (events)
    {
        case GPIO_INT_NONE:
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
        case GPIO_INT_EDGE_LOW:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
        case GPIO_INT_LEVEL_LOW:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
        case GPIO_INT_EDGE_HIGH:
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
        case GPIO_INT_LEVEL_HIGH:
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
        case GPIO_INT_EDGE_BOTH:
            LL_EXTI_EnableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            LL_EXTI_EnableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
            break;
    }

    switch (gpioPortPinNumber)
    {
        case EXTI0:
            if (ActiveInterruptPin[EXTI0] == PinNameValue::NONE || ActiveInterruptPin[EXTI0] == pinNameValue)
            {
                ActiveInterruptPin[EXTI0] = pinNameValue;
                NVIC_SetPriority(EXTI0_IRQn, priority);
                NVIC_EnableIRQ(EXTI0_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case EXTI1:
            if (ActiveInterruptPin[EXTI1] == PinNameValue::NONE || ActiveInterruptPin[EXTI1] == pinNameValue)
            {
                ActiveInterruptPin[EXTI1] = pinNameValue;
                NVIC_SetPriority(EXTI1_IRQn, priority);
                NVIC_EnableIRQ(EXTI1_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case EXTI2:
            if (ActiveInterruptPin[EXTI2] == PinNameValue::NONE || ActiveInterruptPin[EXTI2] == pinNameValue)
            {
                ActiveInterruptPin[EXTI2] = pinNameValue;
                NVIC_SetPriority(EXTI2_IRQn, priority);
                NVIC_EnableIRQ(EXTI2_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case EXTI3:
            if (ActiveInterruptPin[EXTI3] == PinNameValue::NONE || ActiveInterruptPin[EXTI3] == pinNameValue)
            {
                ActiveInterruptPin[EXTI3] = pinNameValue;
                NVIC_SetPriority(EXTI3_IRQn, priority);
                NVIC_EnableIRQ(EXTI3_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case EXTI4:
            if (ActiveInterruptPin[EXTI4] == PinNameValue::NONE || ActiveInterruptPin[EXTI4] == pinNameValue)
            {
                ActiveInterruptPin[EXTI4] = pinNameValue;
                NVIC_SetPriority(EXTI4_IRQn, priority);
                NVIC_EnableIRQ(EXTI4_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 5:
            if (ActiveInterruptPin[EXTI5] == PinNameValue::NONE || ActiveInterruptPin[EXTI5] == pinNameValue)
            {
                ActiveInterruptPin[EXTI5] = pinNameValue;
                NVIC_SetPriority(EXTI9_5_IRQn, priority);
                NVIC_EnableIRQ(EXTI9_5_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 6:
            if (ActiveInterruptPin[EXTI6] == PinNameValue::NONE || ActiveInterruptPin[EXTI6] == pinNameValue)
            {
                ActiveInterruptPin[EXTI6] = pinNameValue;
                NVIC_SetPriority(EXTI9_5_IRQn, priority);
                NVIC_EnableIRQ(EXTI9_5_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 7:
            if (ActiveInterruptPin[EXTI7] == PinNameValue::NONE || ActiveInterruptPin[EXTI7] == pinNameValue)
            {
                ActiveInterruptPin[EXTI7] = pinNameValue;
                NVIC_SetPriority(EXTI9_5_IRQn, priority);
                NVIC_EnableIRQ(EXTI9_5_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 8:
            if (ActiveInterruptPin[EXTI8] == PinNameValue::NONE || ActiveInterruptPin[EXTI8] == pinNameValue)
            {
                ActiveInterruptPin[EXTI8] = pinNameValue;
                NVIC_SetPriority(EXTI9_5_IRQn, priority);
                NVIC_EnableIRQ(EXTI9_5_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 9:
            if (ActiveInterruptPin[EXTI9] == PinNameValue::NONE || ActiveInterruptPin[EXTI9] == pinNameValue)
            {
                ActiveInterruptPin[EXTI9] = pinNameValue;
                NVIC_SetPriority(EXTI9_5_IRQn, priority);
                NVIC_EnableIRQ(EXTI9_5_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 10:
            if (ActiveInterruptPin[EXTI10] == PinNameValue::NONE || ActiveInterruptPin[EXTI10] == pinNameValue)
            {
                ActiveInterruptPin[EXTI10] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 11:
            if (ActiveInterruptPin[EXTI11] == PinNameValue::NONE || ActiveInterruptPin[EXTI11] == pinNameValue)
            {
                ActiveInterruptPin[EXTI11] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 12:
            if (ActiveInterruptPin[EXTI12] == PinNameValue::NONE || ActiveInterruptPin[EXTI12] == pinNameValue)
            {
                ActiveInterruptPin[EXTI12] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 13:
            if (ActiveInterruptPin[EXTI13] == PinNameValue::NONE || ActiveInterruptPin[EXTI13] == pinNameValue)
            {
                ActiveInterruptPin[EXTI13] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 14:
            if (ActiveInterruptPin[EXTI14] == PinNameValue::NONE || ActiveInterruptPin[EXTI14] == pinNameValue)
            {
                ActiveInterruptPin[EXTI14] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
        case 15:
            if (ActiveInterruptPin[EXTI15] == PinNameValue::NONE || ActiveInterruptPin[EXTI15] == pinNameValue)
            {
                ActiveInterruptPin[EXTI15] = pinNameValue;
                NVIC_SetPriority(EXTI15_10_IRQn, priority);
                NVIC_EnableIRQ(EXTI15_10_IRQn);
            }
            else
            {
                result = false;
            }
            break;
    }
    LL_EXTI_EnableIT_0_31(EXTI_Line[gpioPortPinNumber]);

    return result;
}
bool GpioIO::InterruptDisable(PinNameValue pinNameValue)
{
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);
    LL_D3_EXTI_DisablePendMask_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableIT_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    SYSCFG->EXTICR[EXTI_Line[gpioPortPinNumber] & 0x3U] |= ~(EXTI_Line[gpioPortPinNumber] >> 16U);
    return true;
}
bool GpioIO::InterruptRemove(PinNameValue pinNameValue)
{
    uint32_t gpioPortPinNumber = PIN_INDEX(pinNameValue);
    // Clear the External Interrupt or Event for the current IO
    LL_D3_EXTI_DisablePendMask_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableIT_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableFallingTrig_0_31(EXTI_Line[gpioPortPinNumber]);
    LL_EXTI_DisableRisingTrig_0_31(EXTI_Line[gpioPortPinNumber]);

