TerryFogg/nf-Community-Targets/ThreadX/ST/STM32H7/Common/DeviceIO.cpp
    // Clear the config of the line
    SYSCFG->EXTICR[EXTI_Line[gpioPortPinNumber] & 0x3U] |= ~(EXTI_Line[gpioPortPinNumber] >> 16U);

    return true;
}

void EXTI0_IRQHandler()
{
    bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI0]);
    Callback_EVENT_GPIO(ActiveInterruptPin[EXTI0], pinState);
}
void EXTI1_IRQHandler()
{
    bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI1]);
    Callback_EVENT_GPIO(ActiveInterruptPin[EXTI1], pinState);
}
void EXTI2_IRQHandler()
{
    bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI2]);
    Callback_EVENT_GPIO(ActiveInterruptPin[EXTI2], pinState);
}
void EXTI3_IRQHandler()
{
    bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI3]);
    Callback_EVENT_GPIO(ActiveInterruptPin[EXTI3], pinState);
}
void EXTI4_IRQHandler()
{
    bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI4]);
    Callback_EVENT_GPIO(ActiveInterruptPin[EXTI4], pinState);
}
void EXTI9_5_IRQHandler()
{
    if (LL_EXTI_IsActiveFlag_0_31(5))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI5]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI5], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(6))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI6]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI6], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(7))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI7]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI7], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(8))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI8]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI8], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(9))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI9]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI9], pinState);
    }
}
void EXTI15_10_IRQHandler()
{
    if (LL_EXTI_IsActiveFlag_0_31(10))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI10]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI10], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(11))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI11]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI11], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(12))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI12]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI12], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(13))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI13]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI13], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(14))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI14]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI14], pinState);
    }
    else if (LL_EXTI_IsActiveFlag_0_31(15))
    {
        bool pinState = GpioIO::Read(ActiveInterruptPin[EXTI15]);
        Callback_EVENT_GPIO(ActiveInterruptPin[EXTI1], pinState);
    }
}

#pragma endregion

#pragma region ADC

// 2× ADCs with 16-bit max. resolution (up to 24 channels, up to 3.6 MSPS)
// 1× Analog and 1x Digital temperature sensors
// 3x Channels (1 single channel + 1 dual-channel interfaces)
// Analog temperature sensor generates a voltage that varies linearly with the temperature.
// This temperature sensor is internally connected to ADC2_IN18.
// The conversion range is between 1.7 V and 3.6 V.It can measure
// the device junction temperature ranging from ?40 to + 125 °C.bool
//

CLR_INT32 AdcIO::MaximumValue()
{
    return 65535;
}
int AdcIO::MinimumValue()
{
    return 0;
}
int AdcIO::Resolution()
{
    return 16;
}
int AdcIO::ChannelCount()
{
    return 3;
}
bool AdcIO::Initialize()
{
    {
        // int GPIOPortByNumber = PORT_INDEX(pinNameValue);
        // if (!LL_AHB1_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]))
        //{
        //     LL_AHB1_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);
        // }
        // return true;

        //// Enable ADC gpio
        // LL_AHB1_GRP1_EnableClock(GpioPortClockEnable[GPIOPortByNumber]);

        // #define POT1_CLK_ENABLE()  __HAL_RCC_ADC12_CLK_ENABLE()
        // GPIO_InitTypeDef gpio_init_structure;
        // POT1_CLK_ENABLE();
        // POT1_CHANNEL_GPIO_CLK_ENABLE();
        //
        // /* ADC Channel GPIO pin configuration */
        // gpio_init_structure.Pin = POT1_CHANNEL_GPIO_PIN;
        // gpio_init_structure.Mode = GPIO_MODE_ANALOG;
        // gpio_init_structure.Pull = GPIO_NOPULL;
        // HAL_GPIO_Init(POT1_CHANNEL_GPIO_PORT, &gpio_init_structure);
    }

    return true;
}
bool AdcIO::Dispose(CLR_INT32 adc_channel_number)
{
    //  PinNameValue pinNameValue = GetAdcPinNameValueFromChannelNumber(adc_channel_number);

    (void)adc_channel_number;
    {
        // #define POT1_CLK_DISABLE() __HAL_RCC_ADC12_CLK_DISABLE()
        // GPIO_InitTypeDef gpio_init_structure;
        //
        //
        // /* POT GPIO pin configuration */
        // gpio_init_structure.Pin = POT1_CHANNEL_GPIO_PIN;
        // HAL_GPIO_DeInit(POT1_CHANNEL_GPIO_PORT, gpio_init_structure.Pin);
        //
        // /* Disable ADC clock */
        // POT1_CLK_DISABLE();
    }
    return true;
}
bool AdcIO::Open(CLR_INT32 adc_channel_number)
{
    (void)adc_channel_number;
    {

        // ADC1_MspInit(&hpot_adc[POT]);
        // if (MX_ADC1_Init(&hpot_adc[POT]) != HAL_OK)
        // {
        //     ret = BSP_ERROR_PERIPH_FAILURE;
        // }
    }
    return true;
}
CLR_UINT16 AdcIO::Read(CLR_INT32 adc_channel_number)
{
    (void)adc_channel_number;
    {
        // if (HAL_ADC_Start(&hpot_adc[POT]) == HAL_OK)
        // {
        //     if (HAL_ADC_PollForConversion(&hpot_adc[POT], POT_ADC_POLL_TIMEOUT) == HAL_OK)
        //     {
        //         if (HAL_ADC_GetValue(&hpot_adc[POT]) <= (uint32_t)0xFFF)
        //         {
        //             ret = (int32_t)POT_CONVERT2PERC((uint16_t)HAL_ADC_GetValue(&hpot_adc[POT]));
        //         }
        //     }
        // }
    }
    return 1;
}
//__weak HAL_StatusTypeDef MX_ADC1_Init(ADC_HandleTypeDef *hadc)
//{
//    HAL_StatusTypeDef ret = HAL_OK;
//    ADC_ChannelConfTypeDef sConfig;
//
//    /* ADC configuration */
//    hadc->Instance = POT1_ADC;
//    hadc->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
//    hadc->Init.Resolution = ADC_RESOLUTION_12B;
//    hadc->Init.ScanConvMode = (uint32_t)DISABLE;
// #if defined(ADC_EOC_SINGLE_CONV)
//    hadc->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
// #endif
//    hadc->Init.ContinuousConvMode = DISABLE;
//    hadc->Init.NbrOfConversion = 1;
//    hadc->Init.DiscontinuousConvMode = DISABLE;
//    hadc->Init.NbrOfDiscConversion = 0;
//    hadc->Init.ExternalTrigConv = ADC_EXTERNALTRIG_T1_CC1;
//    hadc->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
//
//    if (HAL_ADC_Init(hadc) != HAL_OK)
//    {
//        ret = HAL_ERROR;
//    }
//    else
//    {
//        /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample
//        time.
//         */
//        sConfig.Channel = POT1_ADC_CHANNEL;
//        sConfig.Rank = 1;
//        sConfig.SamplingTime = POT1_SAMPLING_TIME;
//        sConfig.Offset = 0;
// #if defined(ADC_SINGLE_ENDED)
//        sConfig.SingleDiff = ADC_SINGLE_ENDED;
// #endif
// #if defined(ADC_OFFSET_NONE)
//        sConfig.OffsetNumber = ADC_OFFSET_NONE;
// #endif
//        if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK)
//        {
//            ret = HAL_ERROR;
//        }
//    }
//
//    return ret;
//}
PinNameValue AdcIO::ChannelToPin(CLR_INT32 adc_channel_number)
{
    (void)adc_channel_number;
    return (PinNameValue)1;
}
CLR_UINT16 AdcIO::IsModeSupported(AdcChannelMode requestedMode)
{
    bool modeSupported = false;
    if (requestedMode == AdcChannelMode::AdcChannelMode_SingleEnded)
    {
        modeSupported = true;
    }
    if (requestedMode == AdcChannelMode::AdcChannelMode_Differential)
    {
        modeSupported = false;
    }
    return modeSupported;
}
#pragma endregion

#pragma region DAC
// 1× 12-bit single-channel DAC (in SRD domain)
// 1× 12-bit dual-channel DAC
bool DacIO::Initialize(CLR_INT32 dac_channel_number)
{
    (void)dac_channel_number;
    return true;
}
bool DacIO::Dispose(CLR_INT32 dac_channel_number)
{
    (void)dac_channel_number;
    return true;
}
CLR_INT32 DacIO::Resolution()
{
    return 1;
}
CLR_INT32 DacIO::ChannelCount()
{
    return 1;
}
bool DacIO::Open(CLR_INT32 controllerId, CLR_INT32 dac_channel_number)
{
    (void)dac_channel_number;

    CLR_INT32 llDACChannel = __LL_DAC_DECIMAL_NB_TO_CHANNEL(controllerId);
    if (dac_channel_number == 1)
    {
        llDACChannel = LL_DAC_CHANNEL_1;
    }
    else
    {
        llDACChannel = LL_DAC_CHANNEL_2;
    }
    LL_DAC_InitTypeDef DAC_InitStruct;
    LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOA);
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_DAC12);
    LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_4, LL_GPIO_MODE_ANALOG);

    DAC_InitStruct.TriggerSource = LL_DAC_TRIG_SOFTWARE;
    DAC_InitStruct.WaveAutoGeneration = LL_DAC_WAVE_AUTO_GENERATION_NONE;
    DAC_InitStruct.WaveAutoGenerationConfig = LL_DAC_NOISE_LFSR_UNMASK_BIT0;
    DAC_InitStruct.OutputBuffer = LL_DAC_OUTPUT_BUFFER_ENABLE;
    DAC_InitStruct.OutputConnection = LL_DAC_OUTPUT_CONNECT_GPIO;
    DAC_InitStruct.OutputMode = LL_DAC_OUTPUT_MODE_NORMAL;
    LL_DAC_Init(DAC_Channel[dac_channel_number], llDACChannel, &DAC_InitStruct);
    return false;
}
char *DacIO::DeviceSelector(int controllerId)
{
    CLR_INT32 llDACChannel = __LL_DAC_DECIMAL_NB_TO_CHANNEL(controllerId);
    static char DeviceNameDummy[] = "NotSupported\0";
    switch (llDACChannel)
    {
        case 0:
        case 1:
        case 2:
        case 3:
            break;
    }
    return DeviceNameDummy;
}
void DacIO::Write(CLR_INT32 dac_channel_number, CLR_INT32 value)
{
    (void)dac_channel_number;
    (void)value;
}
PinNameValue DacIO::ChannelToPin(CLR_INT32 dac_channel_number)
{
    (void)dac_channel_number;
    return (PinNameValue)1;
}
#pragma endregion

#pragma region I2C
bool I2cIO::Initialize(CLR_INT32 I2C_deviceId, I2cBusSpeed I2C_speed)
{
    LL_RCC_ClocksTypeDef RCC_Clocks;
    LL_RCC_GetSystemClocksFreq(&RCC_Clocks);

