TerryFogg/nf-Community-Targets/ThreadX/ST/STM32H7/Common/DeviceIO.cpp
        // wpUSART Transmit Initialize
        LL_DMA_SetPeriphRequest(DMAx, wpDMA_TransmitStream, wpDMA_TransmitMux);
        LL_DMA_SetDataTransferDirection(DMAx, wpDMA_TransmitStream, LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
        LL_DMA_SetStreamPriorityLevel(DMAx, wpDMA_TransmitStream, LL_DMA_PRIORITY_LOW);
        LL_DMA_SetMode(DMAx, wpDMA_TransmitStream, LL_DMA_MODE_NORMAL);
        LL_DMA_SetPeriphIncMode(DMAx, wpDMA_TransmitStream, LL_DMA_PERIPH_NOINCREMENT);
        LL_DMA_SetMemoryIncMode(DMAx, wpDMA_TransmitStream, LL_DMA_MEMORY_INCREMENT);
        LL_DMA_SetPeriphSize(DMAx, wpDMA_TransmitStream, LL_DMA_PDATAALIGN_BYTE);
        LL_DMA_SetMemorySize(DMAx, wpDMA_TransmitStream, LL_DMA_MDATAALIGN_BYTE);
        LL_DMA_DisableFifoMode(DMAx, wpDMA_TransmitStream);
        LL_DMA_SetPeriphAddress(
            DMAx,
            wpDMA_TransmitStream,
            LL_USART_DMA_GetRegAddr(USARTx, LL_USART_DMA_REG_DATA_TRANSMIT));

        // Enable receive half transfer interrupt
        LL_DMA_EnableIT_HT(DMAx, wpDMA_ReceiveStream);

        // Enable receive transfer complete interrupt
        LL_DMA_EnableIT_TC(DMAx, wpDMA_ReceiveStream);

        // Enable transmit transfer complete interrupt
        LL_DMA_EnableIT_TC(DMAx, wpDMA_TransmitStream);

        // DMA interrupt initialize
        NVIC_SetPriority(wpDMA_ReceiveStreamInterrupt, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
        NVIC_EnableIRQ(wpDMA_ReceiveStreamInterrupt);
        NVIC_SetPriority(wpDMA_TransmitStreamInterrupt, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
        NVIC_EnableIRQ(wpDMA_TransmitStreamInterrupt);

        // Configure WireProtocol wpUSART
        USART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
        USART_InitStruct.BaudRate = baudrate;
        USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
        USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
        USART_InitStruct.Parity = LL_USART_PARITY_NONE;
        USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
        USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
        USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;

        LL_USART_Disable(USARTx);
        {
            LL_USART_Init(USARTx, &USART_InitStruct);
            LL_USART_SetTXFIFOThreshold(USARTx, LL_USART_FIFOTHRESHOLD_7_8);
            LL_USART_SetRXFIFOThreshold(USARTx, LL_USART_FIFOTHRESHOLD_7_8);
            LL_USART_EnableFIFO(USARTx);
            LL_USART_ConfigAsyncMode(USARTx);
            LL_USART_EnableDMAReq_RX(USARTx);
            LL_USART_EnableDMAReq_TX(USARTx);
            LL_USART_EnableIT_IDLE(USARTx);

            // USART interrupt, same priority as DMA channel
            NVIC_SetPriority(wpUSART_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
            NVIC_EnableIRQ(wpUSART_IRQn);

            LL_DMA_EnableStream(wpDMA, wpDMA_ReceiveStream);
        }
        LL_USART_Enable(USARTx);

        // Polling USARTx initialization
        while (!LL_USART_IsActiveFlag_TEACK(USARTx) || !LL_USART_IsActiveFlag_REACK(USARTx))
        {
        }
    }
    return status;
}
bool SerialIO::Dispose(CLR_INT32 usartDeviceNumber)
{
    DMA_TypeDef *DMAx = DMA_Channel[usartDeviceNumber];
    LL_DMA_DeInit(DMAx, DmaStreamNumber[usartDeviceNumber]);
    return true;
}
CLR_INT32 SerialIO::BytesAvailable(CLR_INT32 usartDeviceNumber)
{
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);
    return wp_BufferBytesWaiting(&DeviceReceiveCircularBuffer[index]);
}
bool SerialIO::ReadBytes(CLR_INT32 usartDeviceNumber, CLR_UINT8 *data, CLR_INT32 bytesRequested)
{
    int bytesAvailableToRead = SerialIO::BytesAvailable(usartDeviceNumber);
    if (bytesRequested > bytesAvailableToRead)
    {
        bytesRequested = bytesAvailableToRead;
    }
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);
    ULONG read = wp_ReadBuffer(&DeviceReceiveCircularBuffer[index], data, bytesRequested);
    return read;
}
bool SerialIO::ReadLine(CLR_INT32 usartDeviceNumber, char *newLine, CLR_UINT8 length, char *line)
{
    UNUSED(usartDeviceNumber);
    UNUSED(newLine);
    UNUSED(line);
    UNUSED(length);
    return true;
}
bool SerialIO::SetSignalLevels(CLR_INT32 usartDeviceNumber, bool inversion)
{
    UNUSED(usartDeviceNumber);
    UNUSED(inversion);
    return true;
}
bool SerialIO::GetSignalLevels(CLR_INT32 usartDeviceNumber)
{
    UNUSED(usartDeviceNumber);
    return true;
}
bool SerialIO::WriteBytes(CLR_INT32 usartDeviceNumber, CLR_UINT8 *data, CLR_INT32 size)
{
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);
    wp_WriteBuffer(&DeviceTransmitCircularBuffer[index], data, size);
    return true;
}
bool SerialIO::SetWatchCharacter(CLR_INT32 usartDeviceNumber, CLR_UINT8 watch_character)
{
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);
    UNUSED(index);
    UNUSED(watch_character);
    return true;
}
bool SerialIO::SetReceiveThreshold(CLR_INT32 usartDeviceNumber, CLR_INT32 threshold)
{
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);
    UNUSED(threshold);
    UNUSED(index);
    return 1;
}
char *SerialIO::GetDevice(CLR_INT32 usartDeviceNumber)
{
    static char DeviceSelector[1];
    int index = GetSerialDeviceBufferIndex(usartDeviceNumber);

    UNUSED(index);
    DeviceSelector[0] = ' ';
    return DeviceSelector;
}
bool SerialIO::InvertSignalLevels(CLR_INT32 usartDeviceNumber, bool InvertSignal)
{
    USART_TypeDef *USARTx = (USART_TypeDef *)Serial_Channel[usartDeviceNumber].controllerId;
    if (InvertSignal)
    {
        LL_USART_SetRXPinLevel(USARTx, LL_USART_RXPIN_LEVEL_INVERTED);
    }
    else
    {
        LL_USART_SetRXPinLevel(USARTx, LL_USART_RXPIN_LEVEL_STANDARD);
    }
    return true;
}
bool SerialIO::SetBaudRate(CLR_INT32 usartDeviceNumber, CLR_INT32 baudRate)
{
    UNUSED(usartDeviceNumber);
    UNUSED(baudRate);
    return true;
}
bool SerialIO::SetConfig(CLR_INT32 usartDeviceNumber, CLR_INT32 stopBits, CLR_INT32 dataBits, CLR_INT32 RequestedParity)
{
    UNUSED(usartDeviceNumber);
    UNUSED(stopBits);
    UNUSED(dataBits);
    UNUSED(RequestedParity);
    return true;
}
bool SerialIO::SetHandshake(CLR_INT32 usartDeviceNumber, Handshake handshake)
{
    UNUSED(usartDeviceNumber);

